def area(a, b):
    '''
    расчитывает площадь прямоугольника со сторонами a, b

    принимает:
    a (float) сторона a
    b (float) прилежащая к стороне a
    
    возвращает площадь заданного прямоугольника (int/float)
    '''
    return a * b 

def perimeter(a, b):
    '''
    расчитывает периметр прямоугольника со сторонами a, b

    принимает:
    a (float) сторона a
    b (float) прилежащая к стороне a

    возврщает периметр заданного прямоугольника (int/float)
    '''
    return (a + b) * 2
